In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
df=pd.read_excel("Women Entrepreneurs Meetup (Responses).xlsx")
df.head()

,Timestamp,Full Name,City,Brief about your start-up
0,2020-08-20 16:39:50.273,Mehak Nayyar,Bareilly,Make handmade products at home related to knit...
1,2020-08-20 18:08:17.990,Anshika Jain,Sagar,Craft based product design
2,2020-08-20 18:14:07.821,Bhairavee Pradhan-Nitave,Pune,I am a working professional.
3,2020-08-20 18:21:00.268,Monika,Chennai,Really new to this so no idea
4,2020-08-20 19:32:41.238,Stuti Prasad,MUMBAI,I am working with a road safety startup.

In [4]:
df.shape

(98, 4)

In [99]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 98 entries, 0 to 97
Data columns (total 4 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Timestamp                   98 non-null     datetime64[ns]
 1   Full Name                   98 non-null     object
 2   City                        98 non-null     object
 3   Brief about your start-up   98 non-null     object
dtypes: datetime64[ns](1), object(3)
memory usage: 3.2+ KB

In [100]:
#df['Time'],df['Date']= df['Date'].apply(lambda x:x.time()), df['Date'].apply(lambda x:x.date())
df['Dates'] = pd.to_datetime(df['Timestamp'], format='%Y:%M:%D').dt.date
df['Hours'] = pd.to_datetime(df['Timestamp'], format='%Y:%M:%D').dt.time

In [101]:
df.head()

,Timestamp,Full Name,City,Brief about your start-up,Dates,Hours
0,2020-08-20 16:39:50.273,Mehak Nayyar,Bareilly,Make handmade products at home related to knit...,2020-08-20,16:39:50.273000
1,2020-08-20 18:08:17.990,Anshika Jain,Sagar,Craft based product design,2020-08-20,18:08:17.990000
2,2020-08-20 18:14:07.821,Bhairavee Pradhan-Nitave,Pune,I am a working professional.,2020-08-20,18:14:07.821000
3,2020-08-20 18:21:00.268,Monika,Chennai,Really new to this so no idea,2020-08-20,18:21:00.268000
4,2020-08-20 19:32:41.238,Stuti Prasad,MUMBAI,I am working with a road safety startup.,2020-08-20,19:32:41.238000

In [102]:
df=df.drop(columns={"Timestamp"},axis=1)

In [107]:
df.head()

,Full Name,City,Brief about your start-up,Dates,Hours
0,Mehak Nayyar,Bareilly,Make handmade products at home related to knit...,2020-08-20,16:39:50.273000
1,Anshika Jain,Sagar,Craft based product design,2020-08-20,18:08:17.990000
2,Bhairavee Pradhan-Nitave,Pune,I am a working professional.,2020-08-20,18:14:07.821000
3,Monika,Chennai,Really new to this so no idea,2020-08-20,18:21:00.268000
4,Stuti Prasad,MUMBAI,I am working with a road safety startup.,2020-08-20,19:32:41.238000

In [119]:
df["City"].value_counts()

Pune                15
Mumbai               6
Bangalore            5
Guwahati             4
Delhi                3
Noida                3
New Delhi            3
Visakhapatnam        2
Lucknow              2
VISAKHAPATNAM        2
Bihar                2
Tezpur               2
Guwahati             2
Shillong             2
Hyderabad            2
RANCHI               1
Chennai              1
South West Delhi     1
Chintamani           1
Dehradun             1
Kurukshetra          1
Hoshangabad m.p.     1
Nashik               1
Ghaziabad            1
Saharsa              1
Udaipur              1
Delhi                1
Amritsar             1
Hyderabad            1
Hyd                  1
Banglore             1
Patna                1
Nagpur               1
MUMBAI               1
London               1
Visakhapatnam        1
Indore               1
Pune                 1
Sagar                1
Kolkata              1
Mumbai               1
New delhi            1
Raigad               1
HYDERABAD            1
Bareilly             1
VADODARA             1
Jagdalpur            1
Ponda Goa            1
Raipur               1
Bareilly             1
hyderabad            1
Jabalpur             1
Navi Mumbai          1
Moradabad            1
new delhi            1
GUWAHATI             1
Vadodara             1
Yamunanagar          1
Name: City, dtype: int64

In [127]:
df["City"]=df["City"].replace({"Pune ":"Pune","Mumbai ": "Mumbai", "MUMBAI":"Mumbai","Navi Mumbai":"Mumbai","Guwahati ":"Guwahati","GUWAHATI":"Guwahati","Delhi ":"Dehli","Visakhapatnam ":"Visakhapatnam","VISAKHAPATNAM ":"Visakhapatnam",
                    "hyderabad":"Hyderabad","HYDERABAD":"Hyderabad","Hyderabad ":"Hyderabad","Hyd":"Hyderabad","new delhi":"New Delhi"
                              ,"New delhi":"New Delhi","Dehli":"Delhi","Bareilly ":"Bareilly","VADODARA":"Vadodara"})

In [128]:
df= df.rename(columns={'Brief about your start-up':'brief'})

In [129]:
df.isnull().sum().sort_values(ascending = False)

Hours                         0
Dates                         0
Brief about your start-up     0
City                          0
Full Name                     0
dtype: int64

In [130]:
df.head()

,Full Name,City,Brief about your start-up,Dates,Hours
0,Mehak Nayyar,Bareilly,Make handmade products at home related to knit...,2020-08-20,16:39:50.273000
1,Anshika Jain,Sagar,Craft based product design,2020-08-20,18:08:17.990000
2,Bhairavee Pradhan-Nitave,Pune,I am a working professional.,2020-08-20,18:14:07.821000
3,Monika,Chennai,Really new to this so no idea,2020-08-20,18:21:00.268000
4,Stuti Prasad,Mumbai,I am working with a road safety startup.,2020-08-20,19:32:41.238000

In [131]:
df["City"].value_counts()

Pune                16
Mumbai               9
Guwahati             7
Hyderabad            6
Visakhapatnam        5
Bangalore            5
New Delhi            5
Delhi                4
Noida                3
Bihar                2
Vadodara             2
Bareilly             2
Shillong             2
Lucknow              2
Tezpur               2
Nagpur               1
London               1
Jagdalpur            1
Patna                1
Banglore             1
Raigad               1
Nashik               1
Jabalpur             1
Ponda Goa            1
Chennai              1
RANCHI               1
Kolkata              1
Raipur               1
Hoshangabad m.p.     1
Sagar                1
Saharsa              1
Dehradun             1
Chintamani           1
South West Delhi     1
Amritsar             1
Udaipur              1
Ghaziabad            1
Indore               1
Kurukshetra          1
Moradabad            1
Yamunanagar          1
Name: City, dtype: int64

In [132]:
df.to_csv("cleaned Women Entrepreneurs Meetup.csv")